{
    "navbar-items": ["Sobre mi", "Habilidades", "Portafolio", "Curriculum", "Contactos"],
    "about-detail": "A pesar de mi falta de experiencia laboral formal, he desarrollado habilidades sólidas a través de la práctica en proyectos personales y la capacitación continua en instituciones reconocidas a nivel nacional y en plataformas en línea. Mi experiencia informal demuestra mi capacidad para afrontar desafíos con confianza. Desde la creación de interfaces atractivas con HTML, CSS y JavaScript en el front-end, hasta la implementación de APIs con Node.js, Express y MySQL en el back-end, estoy preparado para enfrentar desafíos en ambos extremos tecnológicos. Me entusiasma la oportunidad de colaborar en proyectos desafiantes y seguir creciendo profesionalmente.",
    "about-title-1": "¡Hola!, soy ",
    "about-title-2": "Deyvid Marmolejo",
    "about-title-3": ". Ingeniero en sistemas y computación y desarrollador web.",
    "skills-title": "Desarrollo web versátil.",
    "skills-detail": "Sólido conocimiento en el desarrollo de aplicaciones web utilizando una amplia gama de tecnologías y frameworks para adaptarse a las necesidades específicas del proyecto.",
    "porfolio-title": "¡Bienvenido a mi portafolio de proyectos!",
    "portfolio-detail-1": "En mi portafolio, encontrarás una selección de proyectos que abarcan diversos temas y funcionalidades. Desde un CRUD hasta sitios web para una tienda de ropas, cada proyecto refleja mi dedicación al arte del desarrollo web y mi compromiso con la excelencia técnica.",
    "portfolio-detail-2": "Algunas de las tecnologías que utilizo en mis proyectos incluyen JavaScript, CSS y HTML para la creación de interfaces de usuario. Además, tengo el diseño de varias APIs que están enlazadas con bases de datos relacionales como MySQL para garantizar un almacenamiento de datos eficiente y seguro. He trabajado con Python y el framework Django, así como con Node.js, para el desarrollo de APIs con Express.js y react para el desarrollo web en las interfaces de usuario.",
    "portfolio-detail-3": "Mi objetivo al compartir estos proyectos es mostrar mis habilidades y experiencia como desarrollador web, así como buscar oportunidades laborales que me permitan seguir creciendo y desarrollándome profesionalmente en el campo del desarrollo web.",
    "resume-title": "Comprometido con el crecimiento profesional continuo y desempeño en roles de trabajo exigentes.",
    "resume-detail": "Me esfuerzo constantemente por alcanzar un crecimiento profesional continuo, mi dedicación hacia el aprendizaje y la superación personal me impulsa a enfrentar con confianza y determinación cada nuevo desafío que se presente en mi camino laboral",
    "education": "Educación",
    "education-title-1": "Egresado de ingeniería en sistemas y computación",
    "education-detail-1": "Aunque soy apasionado por el desarrollo de aplicaciones, también cuento con una sólida formación como ingeniero en sistemas, he sido capacitado en diversas áreas de la informática, incluyendo redes de telecomunicaciones, administración de servidores y seguridad informática.",
    "education-title-2": "Introducción a la programación",
    "education-detail-2": "Desde los principios básicos de la lógica de programación hasta la sintaxis de los lenguajes de programación, he aprendido a crear algoritmos simples y a escribir código en un entorno de desarrollo. Además, he desarrollado habilidades para resolver problemas de manera estructurada y lógica, lo que me permite abordar desafíos de codificación con confianza y eficiencia.",
    "education-title-3": "JavaScript",
    "education-detail-3": "JavaScript es un lenguaje que me cautivó desde el principio. Durante mi exploración en este campo, no solo dominé el propio lenguaje, sino que también adquirí conocimientos sólidos en tecnologías front-end como HTML, CSS y archivos JSON. Además, me sumergí en el uso de frameworks populares como React y Angular, lo que amplió mis habilidades en el desarrollo de aplicaciones web dinámicas. También aprendí sobre la comunicación con el servidor y, en el backend, utilicé bases de datos como MySQL o MongoDB junto con Node.js y Express, lo que me permitió desarrollar aplicaciones completas desde el frontend hasta el backend con confianza y eficacia.",
    "education-title-5": "Base de datos",
    "education-detail-5": "MySQL me permitió comprender cómo diseñar bases de datos relacionales, crear tablas bien estructuradas y aplicar consultas SQL para gestionar información de manera eficiente. Con esta herramienta desarrollé habilidades en normalización, relaciones entre tablas y optimización de consultas, lo que facilita construir aplicaciones seguras, escalables y con un almacenamiento de datos confiable",
    "education-title-4": "Angular",
    "education-detail-4": "He aprendido a trabajar con Angular aprovechando su enfoque estructurado basado en módulos y componentes, lo que me ha permitido organizar proyectos de manera clara y escalable. Durante mi aprendizaje comprendí cómo utilizar servicios para centralizar la lógica de negocio, aplicar directivas para enriquecer las interfaces y manejar formularios de manera eficiente. También adquirí experiencia con su sistema de ruteo y la inyección de dependencias, lo que facilita la construcción de aplicaciones robustas y bien organizadas. Gracias a Angular, ahora puedo desarrollar soluciones completas que combinan orden, mantenibilidad y un alto rendimiento en entornos web profesionales.",
    "education-title-6": "React",
    "education-detail-6": "He aprendido a usar React para crear interfaces dinámicas y organizarlas en componentes reutilizables, manejando estado y props, aplicando hooks como useState y useEffect, y trabajando con ruteo y librerías externas, lo que me permite desarrollar aplicaciones web más escalables y eficientes",
    "contact-title": "¡Conéctate conmigo! Estoy listo para colaborar en tus próximos proyectos",
    "contact-detail": "¡Estoy emocionado por las oportunidades futuras! Si estás interesado en mi trabajo o tienes alguna pregunta, no dudes en contactarme. Estoy abierto a nuevas oportunidades y ansioso por colaborar en proyectos emocionantes.",
    "nova-detail-1": "Nova Store es una tienda electrónica desarrollada con React y Express, diseñada para ofrecer una experiencia moderna y segura. En el frontend integra librerías como react-router-dom para la navegación dinámica, react-slick y slick-carousel para carruseles de productos, react-toastify para notificaciones interactivas y tailwindcss para un diseño responsivo y atractivo. Todo esto permite una interfaz intuitiva con vistas de productos, carrito de compras y flujo de usuario optimizado.",
    "nova-detail-2": "En el backend, la aplicación utiliza Express junto con MySQL2 para el manejo de datos, bcrypt para la encriptación de contraseñas, jsonwebtoken para autenticación segura con JWT y cookie-parser y cors para la gestión de sesiones y seguridad en las peticiones. Además, se emplea dotenv y zod para la configuración de entornos y validación robusta de datos. El resultado es una plataforma escalable y confiable que combina rendimiento, seguridad y una experiencia de usuario completa."
 
}