{
  "navbar-items": ["About me", "Skills", "Portfolio", "Resume", "Contacts"],
  "about-detail": "Despite my lack of formal work experience, I have developed strong skills through practice in personal projects and continuous training at nationally recognized institutions and online platforms. My informal experience demonstrates my ability to face challenges with confidence. From creating attractive interfaces with HTML, CSS, and JavaScript on the front-end, to implementing APIs with Node.js, Express, and MySQL on the back-end, I am prepared to tackle challenges on both technological ends. I am excited about the opportunity to collaborate on challenging projects and continue growing professionally.",
  "about-title-1": "Hello!, I am ",
  "about-title-2": "Deyvid Marmolejo",
  "about-title-3": ". Systems and Computing Engineer and Web Developer.",
  "skills-title": "Versatile web development.",
  "skills-detail": "Strong knowledge in developing web applications using a wide range of technologies and frameworks to adapt to the specific needs of the project.",
  "porfolio-title": "Welcome to my project portfolio!",
  "portfolio-detail-1": "In my portfolio, you will find a selection of projects covering various topics and functionalities. From a CRUD to websites for a clothing store, each project reflects my dedication to the art of web development and my commitment to technical excellence.",
  "portfolio-detail-2": "Some of the technologies I use in my projects include JavaScript, CSS, and HTML for creating user interfaces. In addition, I have designed several APIs linked to relational databases such as MySQL to ensure efficient and secure data storage. I have worked with Python and the Django framework, as well as Node.js for API development with Express.js, and React for building user interfaces.",
  "portfolio-detail-3": "My goal in sharing these projects is to showcase my skills and experience as a web developer, as well as to seek job opportunities that allow me to continue growing and developing professionally in the field of web development.",
  "resume-title": "Committed to continuous professional growth and performance in demanding work roles.",
  "resume-detail": "I constantly strive to achieve continuous professional growth. My dedication to learning and self-improvement drives me to face each new challenge in my career path with confidence and determination.",
  "education": "Education",
  "education-title-1": "Graduate in Systems and Computing Engineering",
  "education-detail-1": "Although I am passionate about application development, I also have a solid background as a systems engineer. I have been trained in various areas of computer science, including telecommunications networks, server administration, and computer security.",
  "education-title-2": "Introduction to Programming",
  "education-detail-2": "From the basic principles of programming logic to the syntax of programming languages, I have learned to create simple algorithms and write code in a development environment. In addition, I have developed skills to solve problems in a structured and logical way, which allows me to approach coding challenges with confidence and efficiency.",
  "education-title-3": "JavaScript",
  "education-detail-3": "JavaScript is a language that captivated me from the beginning. During my exploration in this field, I not only mastered the language itself but also acquired solid knowledge in front-end technologies such as HTML, CSS, and JSON files. I also immersed myself in popular frameworks like React and Angular, which expanded my skills in developing dynamic web applications. I learned about server communication and, on the backend, used databases such as MySQL or MongoDB along with Node.js and Express, which allowed me to confidently and effectively develop complete applications from frontend to backend.",
  "education-title-5": "Databases",
  "education-detail-5": "MySQL allowed me to understand how to design relational databases, create well-structured tables, and apply SQL queries to manage information efficiently. With this tool, I developed skills in normalization, table relationships, and query optimization, which makes it easier to build secure, scalable applications with reliable data storage.",
  "education-title-4": "Angular",
  "education-detail-4": "I learned to work with Angular by leveraging its structured approach based on modules and components, which allowed me to organize projects clearly and scalably. During my learning, I understood how to use services to centralize business logic, apply directives to enrich interfaces, and manage forms efficiently. I also gained experience with its routing system and dependency injection, which facilitates building robust and well-organized applications. Thanks to Angular, I can now develop complete solutions that combine order, maintainability, and high performance in professional web environments.",
  "education-title-6": "React",
  "education-detail-6": "I learned to use React to create dynamic interfaces and organize them into reusable components, managing state and props, applying hooks like useState and useEffect, and working with routing and external libraries, which allows me to develop more scalable and efficient web applications.",
  "contact-title": "Connect with me! I am ready to collaborate on your upcoming projects",
  "contact-detail": "I am excited about future opportunities! If you are interested in my work or have any questions, feel free to contact me. I am open to new opportunities and eager to collaborate on exciting projects.",
  "nova-detail-1": "Nova Store is an electronic store developed with React and Express, designed to provide a modern and secure experience. On the frontend, it integrates libraries such as react-router-dom for dynamic navigation, react-slick and slick-carousel for product carousels, react-toastify for interactive notifications, and tailwindcss for a responsive and attractive design. All this enables an intuitive interface with product views, shopping cart, and optimized user flow.",
  "nova-detail-2": "On the backend, the application uses Express together with MySQL2 for data management, bcrypt for password encryption, jsonwebtoken for secure JWT authentication, and cookie-parser and cors for session management and request security. Additionally, dotenv and zod are used for environment configuration and robust data validation. The result is a scalable and reliable platform that combines performance, security, and a complete user experience."
}